rammp-org/pace-hmi-fw/sdkconfig.defaults
# TODO: uncomment one of these if you want to support a specifc target by default
# CONFIG_IDF_TARGET="esp32"
# CONFIG_IDF_TARGET="esp32s2"
# CONFIG_IDF_TARGET="esp32s3"
# CONFIG_IDF_TARGET="esp32c3"
# CONFIG_IDF_TARGET="esp32c6"
# CONFIG_IDF_TARGET="esp32h2"
CONFIG_IDF_TARGET="esp32p4"

# This board's ESP32-P4 is silicon revision v1.3. Rev <3.0 and >=3.0 support is
# mutually exclusive in ESP-IDF; the default (v3.1+) refuses to flash this chip.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
# Rev <3.0 silicon runs the CPU from a 360MHz CPLL; 400MHz (the v3.x default)
# fails the esp_clk_init assert at boot.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# 16MB flash with a custom partition table (8M app + 4M storage)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM — required for the MIPI DSI frame buffer (matches the m5stack-tab5
# BSP example's config)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Task stack sizes and tick rate from the m5stack-tab5 BSP example — the
# default 3.5K main stack overflows during LVGL/audio/ADC setup.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144
CONFIG_FREERTOS_HZ=1000

# TODO: uncomment if you want freertos to run at 1 khz instead of the default 100 hz
# CONFIG_FREERTOS_HZ=1000

# TODO: uncomment if you want to run the esp at max clock speed (240 mhz)
# ESP32-specific
#
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# TODO: uncomment if you want to update the event and main task stask sizes
# Common ESP-related
#
# CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
# CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
